# AddCorrectionFactor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingType..::..AddCorrectionFactor Method
TemperatureRatingType Class See Also
---
Add a new electrical correction factor type to this temperature rating type. The given temperature value should be quantified in the document's selected unit of electrical temperature.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CorrectionFactor AddCorrectionFactor(
	double temperature,
	double factor
)
```

Visual Basic
---
```text
Public Function AddCorrectionFactor ( _
	temperature As Double, _
	factor As Double _
) As CorrectionFactor
```

Visual C++
---
```text
public:
CorrectionFactor^ AddCorrectionFactor(
	double temperature,
	double factor
)
```

# ### Parameters
temperature
    Type: System..::..DoubleTemperature of correction factor to be added in the document's selected unit of electrical temperature.
factor
    Type: System..::..DoubleFactor of correction factor to be added.
# ### Return Value
New constructed correction factor.
# See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace